---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.UserCancelled
source: html/2f93df68-e5de-f0de-dad1-1b84a18f476d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.UserCancelled Property

Operation is cancelled by the user.

## Syntax (C#)
```csharp
public static FailureDefinitionId UserCancelled { get; }
```